# Brewfile — `brew bundle` installs everything listed here.
# Run via ./bootstrap.sh, or directly: brew bundle --file Brewfile

# --- CLI Tools ---
brew "tmux"        # terminal multiplexer (auto-launched by Alacritty)
brew "uv"          # python package/proj manager
brew "gh"          # github cli
brew "ripgrep"     # fast grep (rg)
brew "hyperfine"   # benchmarking
brew "go"          # go toolchain
brew "awscli"
brew "duti"        # set default apps by file type (used to make Zed the default editor)
brew "git"
brew "node"
brew "make"
brew "zsh"
brew "opentofu"
brew "derailed/k9s/k9s", trusted: true

# --- Temporal Specific CLIs ---
brew "opalsecurity/brew/opal-security", trusted: true

# --- GUI Apps (casks) ---
cask "zed"         # fast code editor

# --- Fonts ---
cask "font-iosevka"
